; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=351, out_folder=htg/blocksworld/training, instance_id=77, seed=2101, goal_proportion=0.03

(define (problem blocksworld-77)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b230)
    (on b230 b338)
    (on-table b338)
    (clear b210)
    (on b210 b36)
    (on-table b36)
    (clear b296)
    (on b296 b275)
    (on b275 b322)
    (on b322 b240)
    (on-table b240)
    (clear b248)
    (on b248 b85)
    (on b85 b126)
    (on b126 b123)
    (on b123 b52)
    (on b52 b350)
    (on-table b350)
    (clear b221)
    (on b221 b336)
    (on-table b336)
    (clear b149)
    (on b149 b298)
    (on-table b298)
    (clear b250)
    (on b250 b312)
    (on-table b312)
    (clear b14)
    (on b14 b155)
    (on b155 b349)
    (on b349 b337)
    (on-table b337)
    (clear b33)
    (on-table b33)
    (clear b17)
    (on b17 b170)
    (on b170 b167)
    (on b167 b100)
    (on b100 b66)
    (on b66 b106)
    (on b106 b22)
    (on b22 b294)
    (on b294 b99)
    (on-table b99)
    (clear b88)
    (on-table b88)
    (clear b165)
    (on b165 b344)
    (on-table b344)
    (clear b206)
    (on b206 b283)
    (on b283 b60)
    (on b60 b125)
    (on-table b125)
    (clear b50)
    (on b50 b68)
    (on-table b68)
    (clear b301)
    (on b301 b83)
    (on b83 b40)
    (on-table b40)
    (clear b6)
    (on b6 b10)
    (on b10 b117)
    (on b117 b257)
    (on b257 b347)
    (on b347 b256)
    (on b256 b255)
    (on-table b255)
    (clear b62)
    (on b62 b205)
    (on b205 b196)
    (on b196 b169)
    (on-table b169)
    (clear b245)
    (on b245 b129)
    (on b129 b342)
    (on b342 b168)
    (on-table b168)
    (clear b218)
    (on-table b218)
    (clear b217)
    (on-table b217)
    (clear b160)
    (on b160 b25)
    (on b25 b51)
    (on-table b51)
    (clear b84)
    (on b84 b251)
    (on b251 b134)
    (on-table b134)
    (clear b103)
    (on b103 b105)
    (on b105 b199)
    (on b199 b351)
    (on b351 b227)
    (on b227 b271)
    (on b271 b11)
    (on b11 b32)
    (on b32 b121)
    (on b121 b304)
    (on b304 b143)
    (on b143 b241)
    (on b241 b302)
    (on b302 b30)
    (on b30 b151)
    (on b151 b315)
    (on b315 b211)
    (on b211 b128)
    (on b128 b186)
    (on b186 b195)
    (on b195 b274)
    (on-table b274)
    (clear b247)
    (on b247 b208)
    (on-table b208)
    (clear b325)
    (on b325 b323)
    (on b323 b43)
    (on-table b43)
    (clear b284)
    (on b284 b216)
    (on b216 b286)
    (on b286 b34)
    (on-table b34)
    (clear b329)
    (on b329 b282)
    (on-table b282)
    (clear b234)
    (on b234 b345)
    (on-table b345)
    (clear b20)
    (on-table b20)
    (clear b29)
    (on b29 b239)
    (on-table b239)
    (clear b162)
    (on b162 b308)
    (on b308 b91)
    (on-table b91)
    (clear b261)
    (on-table b261)
    (clear b200)
    (on b200 b254)
    (on b254 b74)
    (on b74 b138)
    (on b138 b53)
    (on-table b53)
    (clear b171)
    (on b171 b59)
    (on b59 b229)
    (on b229 b175)
    (on-table b175)
    (clear b197)
    (on-table b197)
    (clear b46)
    (on b46 b244)
    (on b244 b115)
    (on b115 b3)
    (on b3 b310)
    (on b310 b223)
    (on-table b223)
    (clear b28)
    (on b28 b263)
    (on b263 b249)
    (on b249 b202)
    (on-table b202)
    (clear b45)
    (on b45 b324)
    (on-table b324)
    (clear b288)
    (on b288 b16)
    (on b16 b127)
    (on b127 b309)
    (on b309 b156)
    (on b156 b335)
    (on-table b335)
    (clear b161)
    (on b161 b180)
    (on-table b180)
    (clear b42)
    (on b42 b73)
    (on b73 b110)
    (on b110 b228)
    (on b228 b124)
    (on b124 b320)
    (on b320 b163)
    (on-table b163)
    (clear b133)
    (on b133 b114)
    (on b114 b215)
    (on b215 b101)
    (on-table b101)
    (clear b49)
    (on b49 b231)
    (on b231 b198)
    (on-table b198)
    (clear b86)
    (on b86 b140)
    (on b140 b243)
    (on b243 b300)
    (on b300 b132)
    (on b132 b159)
    (on-table b159)
    (clear b97)
    (on-table b97)
    (clear b285)
    (on-table b285)
    (clear b177)
    (on b177 b184)
    (on b184 b164)
    (on b164 b203)
    (on-table b203)
    (clear b13)
    (on b13 b64)
    (on-table b64)
    (clear b313)
    (on b313 b104)
    (on b104 b348)
    (on b348 b340)
    (on b340 b119)
    (on-table b119)
    (clear b135)
    (on b135 b305)
    (on-table b305)
    (clear b56)
    (on b56 b287)
    (on b287 b214)
    (on-table b214)
    (clear b77)
    (on b77 b266)
    (on b266 b131)
    (on-table b131)
    (clear b319)
    (on b319 b269)
    (on b269 b95)
    (on b95 b187)
    (on-table b187)
    (clear b72)
    (on b72 b8)
    (on b8 b306)
    (on b306 b4)
    (on b4 b339)
    (on b339 b166)
    (on-table b166)
    (clear b152)
    (on b152 b55)
    (on-table b55)
    (clear b276)
    (on b276 b5)
    (on b5 b190)
    (on-table b190)
    (clear b21)
    (on b21 b341)
    (on b341 b58)
    (on-table b58)
    (clear b334)
    (on-table b334)
    (clear b316)
    (on b316 b222)
    (on b222 b252)
    (on b252 b78)
    (on-table b78)
    (clear b321)
    (on b321 b111)
    (on b111 b65)
    (on b65 b118)
    (on-table b118)
    (clear b24)
    (on b24 b327)
    (on b327 b113)
    (on b113 b116)
    (on b116 b61)
    (on b61 b137)
    (on-table b137)
    (clear b281)
    (on b281 b144)
    (on-table b144)
    (clear b270)
    (on b270 b194)
    (on-table b194)
    (clear b35)
    (on b35 b112)
    (on b112 b153)
    (on b153 b290)
    (on b290 b318)
    (on-table b318)
    (clear b189)
    (on b189 b201)
    (on b201 b48)
    (on-table b48)
    (clear b188)
    (on b188 b232)
    (on-table b232)
    (clear b346)
    (on b346 b122)
    (on b122 b299)
    (on-table b299)
    (clear b233)
    (on-table b233)
    (clear b253)
    (on b253 b238)
    (on b238 b172)
    (on b172 b173)
    (on b173 b268)
    (on b268 b130)
    (on-table b130)
    (clear b57)
    (on b57 b120)
    (on b120 b108)
    (on b108 b38)
    (on b38 b23)
    (on b23 b37)
    (on b37 b333)
    (on b333 b41)
    (on b41 b154)
    (on-table b154)
    (clear b54)
    (on b54 b44)
    (on b44 b7)
    (on b7 b178)
    (on b178 b278)
    (on-table b278)
    (clear b70)
    (on b70 b260)
    (on-table b260)
    (clear b267)
    (on b267 b191)
    (on b191 b15)
    (on b15 b26)
    (on-table b26)
    (clear b224)
    (on-table b224)
    (clear b19)
    (on b19 b158)
    (on-table b158)
    (clear b94)
    (on b94 b176)
    (on b176 b179)
    (on-table b179)
    (clear b69)
    (on-table b69)
    (clear b98)
    (on b98 b330)
    (on b330 b343)
    (on b343 b212)
    (on b212 b219)
    (on b219 b96)
    (on b96 b31)
    (on-table b31)
    (clear b148)
    (on b148 b107)
    (on-table b107)
    (clear b272)
    (on b272 b220)
    (on-table b220)
    (clear b183)
    (on b183 b262)
    (on b262 b193)
    (on b193 b2)
    (on-table b2)
    (clear b246)
    (on b246 b92)
    (on-table b92)
    (clear b328)
    (on b328 b235)
    (on-table b235)
    (clear b63)
    (on b63 b12)
    (on b12 b174)
    (on b174 b314)
    (on b314 b277)
    (on b277 b331)
    (on b331 b213)
    (on b213 b258)
    (on b258 b80)
    (on b80 b136)
    (on b136 b192)
    (on b192 b9)
    (on b9 b204)
    (on b204 b226)
    (on b226 b75)
    (on b75 b317)
    (on b317 b242)
    (on-table b242)
    (clear b157)
    (on b157 b182)
    (on-table b182)
    (clear b293)
    (on b293 b279)
    (on-table b279)
    (clear b141)
    (on-table b141)
    (clear b76)
    (on b76 b139)
    (on-table b139)
    (clear b147)
    (on b147 b209)
    (on b209 b79)
    (on b79 b90)
    (on b90 b265)
    (on b265 b145)
    (on b145 b150)
    (on b150 b291)
    (on b291 b259)
    (on b259 b225)
    (on b225 b236)
    (on b236 b280)
    (on b280 b303)
    (on b303 b81)
    (on b81 b146)
    (on b146 b297)
    (on b297 b181)
    (on b181 b311)
    (on b311 b102)
    (on b102 b295)
    (on-table b295)
    (clear b207)
    (on b207 b47)
    (on b47 b82)
    (on b82 b93)
    (on b93 b237)
    (on-table b237)
    (clear b39)
    (on-table b39)
    (clear b109)
    (on b109 b326)
    (on b326 b264)
    (on b264 b18)
    (on-table b18)
    (clear b273)
    (on b273 b87)
    (on-table b87)
    (clear b292)
    (on-table b292)
    (clear b67)
    (on-table b67)
    (clear b289)
    (on b289 b332)
    (on b332 b71)
    (on b71 b307)
    (on b307 b142)
    (on b142 b27)
    (on-table b27)
    (clear b89)
    (on b89 b185)
    (on-table b185))
 (:goal  (and 
    (clear b6)
    (on b6 b4)
    (on b4 b5)
    (on b5 b1)
    (on-table b1)
    (clear b3)
    (on-table b3)
    (clear b7)
    (on-table b7)
    (clear b9)
    (on-table b9)
    (clear b10)
    (on-table b10)
    (clear b2)
    (on-table b2)
    (clear b8)
    (on-table b8))))

; plan
1. (unstack b1 b230)
   deleted: (on b1 b230) (clear b1) (arm-empty)
   added: (holding b1) (clear b230)
   goals met: 2 of 17
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 17
3. (unstack b183 b262)
   deleted: (on b183 b262) (clear b183) (arm-empty)
   added: (holding b183) (clear b262)
   goals met: 3 of 17
4. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 3 of 17
5. (unstack b262 b193)
   deleted: (on b262 b193) (clear b262) (arm-empty)
   added: (holding b262) (clear b193)
   goals met: 3 of 17
6. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 3 of 17
7. (unstack b193 b2)
   deleted: (on b193 b2) (clear b193) (arm-empty)
   added: (holding b193) (clear b2)
   goals met: 4 of 17
8. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 4 of 17
9. (unstack b276 b5)
   deleted: (on b276 b5) (clear b276) (arm-empty)
   added: (holding b276) (clear b5)
   goals met: 4 of 17
10. (putdown b276)
   deleted: (holding b276)
   added: (clear b276) (arm-empty) (on-table b276)
   goals met: 4 of 17
11. (unstack b46 b244)
   deleted: (on b46 b244) (clear b46) (arm-empty)
   added: (holding b46) (clear b244)
   goals met: 4 of 17
12. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 4 of 17
13. (unstack b244 b115)
   deleted: (on b244 b115) (clear b244) (arm-empty)
   added: (holding b244) (clear b115)
   goals met: 4 of 17
14. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 4 of 17
15. (unstack b115 b3)
   deleted: (on b115 b3) (clear b115) (arm-empty)
   added: (holding b115) (clear b3)
   goals met: 5 of 17
16. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 5 of 17
17. (unstack b3 b310)
   deleted: (on b3 b310) (clear b3) (arm-empty)
   added: (holding b3) (clear b310)
   goals met: 4 of 17
18. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 17
19. (unstack b54 b44)
   deleted: (on b54 b44) (clear b54) (arm-empty)
   added: (holding b54) (clear b44)
   goals met: 6 of 17
20. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 6 of 17
21. (unstack b44 b7)
   deleted: (on b44 b7) (clear b44) (arm-empty)
   added: (holding b44) (clear b7)
   goals met: 7 of 17
22. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 7 of 17
23. (unstack b7 b178)
   deleted: (on b7 b178) (clear b7) (arm-empty)
   added: (holding b7) (clear b178)
   goals met: 6 of 17
24. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 17
25. (unstack b63 b12)
   deleted: (on b63 b12) (clear b63) (arm-empty)
   added: (holding b63) (clear b12)
   goals met: 8 of 17
26. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 8 of 17
27. (unstack b12 b174)
   deleted: (on b12 b174) (clear b12) (arm-empty)
   added: (holding b12) (clear b174)
   goals met: 8 of 17
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 8 of 17
29. (unstack b174 b314)
   deleted: (on b174 b314) (clear b174) (arm-empty)
   added: (holding b174) (clear b314)
   goals met: 8 of 17
30. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 8 of 17
31. (unstack b314 b277)
   deleted: (on b314 b277) (clear b314) (arm-empty)
   added: (holding b314) (clear b277)
   goals met: 8 of 17
32. (putdown b314)
   deleted: (holding b314)
   added: (clear b314) (arm-empty) (on-table b314)
   goals met: 8 of 17
33. (unstack b277 b331)
   deleted: (on b277 b331) (clear b277) (arm-empty)
   added: (holding b277) (clear b331)
   goals met: 8 of 17
34. (putdown b277)
   deleted: (holding b277)
   added: (clear b277) (arm-empty) (on-table b277)
   goals met: 8 of 17
35. (unstack b331 b213)
   deleted: (on b331 b213) (clear b331) (arm-empty)
   added: (holding b331) (clear b213)
   goals met: 8 of 17
36. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 8 of 17
37. (unstack b213 b258)
   deleted: (on b213 b258) (clear b213) (arm-empty)
   added: (holding b213) (clear b258)
   goals met: 8 of 17
38. (putdown b213)
   deleted: (holding b213)
   added: (clear b213) (arm-empty) (on-table b213)
   goals met: 8 of 17
39. (unstack b258 b80)
   deleted: (on b258 b80) (clear b258) (arm-empty)
   added: (holding b258) (clear b80)
   goals met: 8 of 17
40. (putdown b258)
   deleted: (holding b258)
   added: (clear b258) (arm-empty) (on-table b258)
   goals met: 8 of 17
41. (unstack b72 b8)
   deleted: (on b72 b8) (clear b72) (arm-empty)
   added: (holding b72) (clear b8)
   goals met: 9 of 17
42. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 9 of 17
43. (unstack b8 b306)
   deleted: (on b8 b306) (clear b8) (arm-empty)
   added: (holding b8) (clear b306)
   goals met: 8 of 17
44. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 10 of 17
45. (unstack b306 b4)
   deleted: (on b306 b4) (clear b306) (arm-empty)
   added: (holding b306) (clear b4)
   goals met: 10 of 17
46. (putdown b306)
   deleted: (holding b306)
   added: (clear b306) (arm-empty) (on-table b306)
   goals met: 10 of 17
47. (unstack b80 b136)
   deleted: (on b80 b136) (clear b80) (arm-empty)
   added: (holding b80) (clear b136)
   goals met: 10 of 17
48. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 10 of 17
49. (unstack b136 b192)
   deleted: (on b136 b192) (clear b136) (arm-empty)
   added: (holding b136) (clear b192)
   goals met: 10 of 17
50. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 10 of 17
51. (unstack b192 b9)
   deleted: (on b192 b9) (clear b192) (arm-empty)
   added: (holding b192) (clear b9)
   goals met: 11 of 17
52. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 11 of 17
53. (unstack b9 b204)
   deleted: (on b9 b204) (clear b9) (arm-empty)
   added: (holding b9) (clear b204)
   goals met: 10 of 17
54. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 12 of 17
55. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 12 of 17
56. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 14 of 17
57. (unstack b10 b117)
   deleted: (on b10 b117) (clear b10) (arm-empty)
   added: (holding b10) (clear b117)
   goals met: 13 of 17
58. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 15 of 17
59. (unstack b5 b190)
   deleted: (on b5 b190) (clear b5) (arm-empty)
   added: (holding b5) (clear b190)
   goals met: 15 of 17
60. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 16 of 17
61. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 14 of 17
62. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 15 of 17
63. (unstack b4 b339)
   deleted: (on b4 b339) (clear b4) (arm-empty)
   added: (holding b4) (clear b339)
   goals met: 15 of 17
64. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 16 of 17
65. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 15 of 17
66. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 17 of 17
